# Pandas is a open source library built on top of Numpy.
It it the Python's version of excel.

## Series

In [18]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [19]:
labels = ['a', 'b', 'c']
my_data =[10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(data = my_data) # For series you can update the index

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = my_data, index= labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series( my_data, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d) # convert the dictionary to a series.

a    10
b    20
c    30
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4],['USA','China','Japan','UK'])
ser1

USA      1
China    2
Japan    3
UK       4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],['USA','China','UK','Italy'])
ser2

USA      1
China    2
UK       5
Italy    4
dtype: int64

In [14]:
ser1+ser2

China    4.0
Italy    NaN
Japan    NaN
UK       9.0
USA      2.0
dtype: float64

## DataFrames

In [16]:
np.random.seed(101) # make sure we get the same random numbers, we get the same randome number as the tutorial??

In [20]:
df = pd.DataFrame(randn(5,4), ['a','b','c','d','e'],['w','x','y','z'])
# each column is a series.
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [21]:
df['w'] # return a column

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [32]:
df.loc['a'] # return a row

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [34]:
df.iloc[0] # the same as df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [35]:
df.loc['b','x'] #

-0.31931804459303326

In [36]:
df.loc[['a','b'],['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077

In [22]:
df[['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [24]:
df['new'] = df['x']+df['z']
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  1.131958
b  0.651118 -0.319318 -0.848077  0.605965  0.286647
c -2.018168  0.740122  0.528813 -0.589001  0.151122
d  0.188695 -0.758872 -0.933237  0.955057  0.196184
e  0.190794  1.978757  2.605967  0.683509  2.662266

In [28]:
df.drop('new', axis =1, inplace = True) # 1 refers to the column, and 0 refers to row

In [29]:
df # if not use 'inplace = True', df will remain the same with the 'new' column

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [31]:
df.drop('e', axis = 0)
df # e row will remain there

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [38]:
bool_df = df >0
bool_df

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [39]:
df[bool_df]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [40]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [41]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [42]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['w']>0]['x']

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [44]:
df[(df['w']>0) & (df['y']>1)] 
# You can not use and operator instead of & |, because you get a series of boolean values on each side

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [45]:
df.reset_index() #

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [46]:
df # inplace = true to get it changed.

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [48]:
newindex = 'CA CO NY WY OR '.split()
newindex

['CA', 'CO', 'NY', 'WY', 'OR']

In [49]:
df['States'] =newindex
df

          w         x         y         z States
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     CO
c -2.018168  0.740122  0.528813 -0.589001     NY
d  0.188695 -0.758872 -0.933237  0.955057     WY
e  0.190794  1.978757  2.605967  0.683509     OR

In [51]:
df.set_index('States')

               w         x         y         z
States
CA      2.706850  0.628133  0.907969  0.503826
CO      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

# Multilayer Index

In [53]:
outside =['G1',  'G1', 'G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [56]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [57]:
df2 = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [58]:
df2

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [60]:
df2.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [61]:
df2.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [65]:
df2.index.names = ['Groups', 'Num']
df2

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [67]:
df2.loc['G2'].loc[2]['B']

0.07295967531703869

## cross section: df.xs

In [68]:
df2.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [69]:
df2.xs(1,level ='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## missing data

In [72]:
dic = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3] }
df3 = pd.DataFrame(dic)
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df3.dropna(axis =1)# drop any row or column if it contains any nan

   C
0  1
1  2
2  3

In [75]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [77]:
df3.dropna(thresh =2) # contains 2 non Nan will not be dropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [78]:
df3.fillna(value='Fill Value')
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
df3['A'].fillna(value = df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

In [81]:
data = {'Company': ['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
       'Person': ['Sam','Charlie', 'Amy', 'Vanessa','Carl', 'Sarah'],
       'Sales': [200,120,340,124, 243,350]}
df4 =pd.DataFrame(data)
df4

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [83]:
df4.groupby('Company')

In [85]:
byComp = df4.groupby('Company')
byComp.mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [86]:
byComp.sum()

           Sales
Company
Facebook     593
Google       320
Microsoft    464

In [87]:
byComp.std()

                Sales
Company
Facebook    75.660426
Google      56.568542
Microsoft  152.735065

In [88]:
byComp.sum().loc['Facebook']

Sales    593
Name: Facebook, dtype: int64

In [93]:
df4.groupby('Company').describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [96]:
df4.groupby('Company').describe().transpose()['Facebook']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Facebook, dtype: float64